Revit 2024 API
ParameterValueProvider Constructor
 Constructs an instance of ParameterValueProvider.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ParameterValueProvider(
	ElementId parameter
)
Visual Basic
Public Sub New ( _
	parameter As ElementId _
)
Visual C++
public:
ParameterValueProvider(
	ElementId^ parameter
)
Parameters
parameter
Type: Autodesk.Revit.DB.ElementId
 The parameter used to provide a string, integer, and double-precision, or ElementId value on request for a given element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ParameterValueProvider Class
Autodesk.Revit.DB Namespace